# def min_max(list1, list2):
#     a = list1+list2
#     a.sort()
#     max_val = max(a)
#     min_val = min(a)
#     return max_val, min_val
#     print(f"максимальное значение:{max_val}. минимальное значение {min_val}.")



# Напишите программу, которая возьмет на вход список с целыми числами и на выходе даст
# два списка: один с четными числами, другой – с нечетными.
# def num_sort(list):
#     a = []
#     b = []
#     for item

# def maximus(a: int, b:int, c: int):
#     list = [a,b,c]
#     # list.extend([a,b,c])
#     max_num = max(list)
#     return max_num

'''list(range(-3, 7))'''
# list = []
# for number in range(-3,7):
#     list.append(number)
# invert_list = list[::1]
# print(invert_list)

# a = ('varya', 45)
# print(a[0])

# def name_st(list : list):
#     name_list = []
#     for name in list:
#         name_list.append(name[0])
#     print(name_list)


